API/Postman + SOAP.txt

Для отправки SOAP запросов при помощи инструмента Postman API
следует выполнить ряд простых действий:

1. Создаём базовый HTTP-запрос
File → New → HTTP-Request

2. Вводим URL-адрес конечной точки SOAP
Например, https://tracking.russianpost.ru/rtm34

3. Выбираем POST метод запроса

4. Меняем тело запроса
Выбираем тип тела "raw", в выпадающем списке выбираем 
формат тела "XML".

5. Вводим XML-данные в тело запроса.
Например,
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
   <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
     <ubiNum>500</ubiNum>
   </NumberToWords>
  </soap:Body>
</soap:Envelope>

6. Настраиваем заголовки запроса.
Открываем вкладку "Headers". Отобразите скрытые заголовки, если они не 
видны. 

7. Изменяем заголовок "Content-Type".
Очищаем значение заголовка "Content-Type" и вводим в качестве значения
"text/xml".

8. Добавляем пару ключ-значение "SOAPAction"-"#MethodName"
Например, SOAPAction - #POST

9. Отправляем запрос и получаем ответ.